; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v2 ?v13)
             (pred_1 ?v3 ?v4)
             (pred_10 ?v2 ?v4)
             (pred_9 ?v7 ?v2 )
	     (pred_2 ?v2)
             (pred_6 ?v12)
             (pred_7 ?v3)
             (pred_5 ?v4)
             (pred_11 ?v2)
             (pred_4 ?v3)
             (pred_8 ?v2)
             (pred_12 ))



(:action op_3
:parameters (?v9 ?v11 ?v6 ?v10)
:precondition (and (pred_6 ?v9) (pred_6 ?v11) (pred_7 ?v6) (pred_5 ?v10)
          (pred_3 ?v9 ?v11) (pred_1 ?v6 ?v10)
                   (pred_10 ?v11 ?v10) (pred_2 ?v9) 
                   (pred_11 ?v11) (pred_4 ?v6))
:effect (and  (pred_8 ?v11) (not (pred_11 ?v11))))


(:action op_5
:parameters (?v9 ?v5)
:precondition (and (pred_6 ?v9) (pred_6 ?v5)
               (pred_2 ?v9) (pred_3 ?v9 ?v5) (pred_8 ?v5))
:effect (and (pred_2 ?v5) (not (pred_2 ?v9))))

(:action op_1
:parameters (?v9 ?v6)
:precondition (and (pred_6 ?v9) (pred_7 ?v6) 
                  (pred_2 ?v9) (pred_9 ?v6 ?v9) (pred_12 ))
:effect (and (pred_4 ?v6)
   (not (pred_9 ?v6 ?v9)) (not (pred_12 ))))


(:action op_4
:parameters (?v9 ?v1 ?v8)
:precondition (and (pred_6 ?v9) (pred_7 ?v1) (pred_7 ?v8)
                  (pred_2 ?v9) (pred_4 ?v8) (pred_9 ?v1 ?v9))
:effect (and (pred_4 ?v1) (pred_9 ?v8 ?v9)
        (not (pred_4 ?v8)) (not (pred_9 ?v1 ?v9))))

(:action op_2
:parameters (?v9 ?v6)
:precondition (and (pred_6 ?v9) (pred_7 ?v6) 
                  (pred_2 ?v9) (pred_4 ?v6))
:effect (and (pred_12 ) (pred_9 ?v6 ?v9) (not (pred_4 ?v6)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_06 obj_08 obj_18 obj_04 obj_11 obj_12 obj_03 obj_20 obj_17 obj_15 obj_14 obj_07 obj_05 obj_10 obj_19 obj_16
    obj_13 obj_01
    obj_02 obj_09
    )

    (:init
       (pred_12)

       (pred_6 obj_06)
       (pred_6 obj_08)
       (pred_6 obj_18)
       (pred_6 obj_04)
       (pred_6 obj_11)
       (pred_6 obj_12)
       (pred_6 obj_03)
       (pred_6 obj_20)
       (pred_6 obj_17)
       (pred_6 obj_15)
       (pred_6 obj_14)
       (pred_6 obj_07)
       (pred_6 obj_05)
       (pred_6 obj_10)
       (pred_6 obj_19)
       (pred_6 obj_16)
       (pred_5 obj_13)
       (pred_5 obj_01)
       (pred_7 obj_02)
       (pred_7 obj_09)

       (pred_3 obj_06 obj_11)
       (pred_3 obj_06 obj_08)
       (pred_3 obj_08 obj_12)
       (pred_3 obj_08 obj_18)
       (pred_3 obj_08 obj_06)
       (pred_3 obj_18 obj_03)
       (pred_3 obj_18 obj_04)
       (pred_3 obj_18 obj_08)
       (pred_3 obj_04 obj_20)
       (pred_3 obj_04 obj_18)
       (pred_3 obj_11 obj_17)
       (pred_3 obj_11 obj_12)
       (pred_3 obj_11 obj_06)
       (pred_3 obj_12 obj_15)
       (pred_3 obj_12 obj_03)
       (pred_3 obj_12 obj_08)
       (pred_3 obj_12 obj_11)
       (pred_3 obj_03 obj_14)
       (pred_3 obj_03 obj_20)
       (pred_3 obj_03 obj_18)
       (pred_3 obj_03 obj_12)
       (pred_3 obj_20 obj_07)
       (pred_3 obj_20 obj_04)
       (pred_3 obj_20 obj_03)
       (pred_3 obj_17 obj_05)
       (pred_3 obj_17 obj_15)
       (pred_3 obj_17 obj_11)
       (pred_3 obj_15 obj_10)
       (pred_3 obj_15 obj_14)
       (pred_3 obj_15 obj_12)
       (pred_3 obj_15 obj_17)
       (pred_3 obj_14 obj_19)
       (pred_3 obj_14 obj_07)
       (pred_3 obj_14 obj_03)
       (pred_3 obj_14 obj_15)
       (pred_3 obj_07 obj_16)
       (pred_3 obj_07 obj_20)
       (pred_3 obj_07 obj_14)
       (pred_3 obj_05 obj_10)
       (pred_3 obj_05 obj_17)
       (pred_3 obj_10 obj_19)
       (pred_3 obj_10 obj_15)
       (pred_3 obj_10 obj_05)
       (pred_3 obj_19 obj_16)
       (pred_3 obj_19 obj_14)
       (pred_3 obj_19 obj_10)
       (pred_3 obj_16 obj_07)
       (pred_3 obj_16 obj_19)
       (pred_11 obj_19)
       (pred_11 obj_07)
       (pred_10  obj_19 obj_13)
       (pred_10  obj_07 obj_01)
       (pred_8 obj_06)
       (pred_8 obj_08)
       (pred_8 obj_18)
       (pred_8 obj_04)
       (pred_8 obj_11)
       (pred_8 obj_12)
       (pred_8 obj_03)
       (pred_8 obj_20)
       (pred_8 obj_17)
       (pred_8 obj_15)
       (pred_8 obj_14)
       (pred_8 obj_05)
       (pred_8 obj_10)
       (pred_8 obj_16)

       (pred_1  obj_02 obj_13)
       (pred_1  obj_09 obj_01)
       (pred_9 obj_02 obj_06)
       (pred_9 obj_09 obj_14)
       (pred_2 obj_18)
    )

    (:goal (and
       (pred_9 obj_02 obj_19)
    ))
(:constraints
  (always (not (pred_2 obj_08)))
)
)

; plan
1. (op_5 obj_18 obj_03)
   deleted: (pred_2 obj_18)
   added: (pred_2 obj_03)
   goals met: 0 of 1
2. (op_5 obj_03 obj_12)
   deleted: (pred_2 obj_03)
   added: (pred_2 obj_12)
   goals met: 0 of 1
3. (op_5 obj_12 obj_11)
   deleted: (pred_2 obj_12)
   added: (pred_2 obj_11)
   goals met: 0 of 1
4. (op_5 obj_11 obj_06)
   deleted: (pred_2 obj_11)
   added: (pred_2 obj_06)
   goals met: 0 of 1
5. (op_1 obj_06 obj_02)
   deleted: (pred_9 obj_02 obj_06) (pred_12)
   added: (pred_4 obj_02)
   goals met: 0 of 1
6. (op_5 obj_06 obj_11)
   deleted: (pred_2 obj_06)
   added: (pred_2 obj_11)
   goals met: 0 of 1
7. (op_5 obj_11 obj_12)
   deleted: (pred_2 obj_11)
   added: (pred_2 obj_12)
   goals met: 0 of 1
8. (op_5 obj_12 obj_03)
   deleted: (pred_2 obj_12)
   added: (pred_2 obj_03)
   goals met: 0 of 1
9. (op_5 obj_03 obj_14)
   deleted: (pred_2 obj_03)
   added: (pred_2 obj_14)
   goals met: 0 of 1
10. (op_3 obj_14 obj_19 obj_02 obj_13)
   deleted: (pred_11 obj_19)
   added: (pred_8 obj_19)
   goals met: 0 of 1
11. (op_5 obj_14 obj_19)
   deleted: (pred_2 obj_14)
   added: (pred_2 obj_19)
   goals met: 0 of 1
12. (op_2 obj_19 obj_02)
   deleted: (pred_4 obj_02)
   added: (pred_12) (pred_9 obj_02 obj_19)
   goals met: 1 of 1
